# brewsky

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# essentials

cask "iterm2"
brew "fish"
brew "starship"
brew "neovim", args: ["HEAD"]
brew "git"
brew "gh"
brew "openssh"
brew "python@3.10"
brew "nvm"
brew "pnpm"

## non app store

cask "karabiner-elements"
cask "cursorsense"
cask "raycast"
cask "betterdisplay"
cask "sketch"
cask "arc"
cask "docker"
cask "iina"
cask "transmission"
cask "setapp"
cask "appcleaner"
cask "diffusionbee"
cask "rectangle"

# app store

brew "mas"
mas "Grammarly for Safari", id: 1462114288
mas "iA Writer", id: 775737590
mas "Mate Translate", id: 1005088137
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Wipr", id: 1320666476
